AlmAck/svdtonuttx/demo/h/da1470x_i2c2.h
/****************************************************************************
 * ./tmp/da1470x_i2c2.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __DA1470X_I2C2_H
#define __DA1470X_I2C2_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "da1470x_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define DA1470X_I2C2_I2C2_ACK_GENERAL_CALL_OFFSET  0x0098 /* I2C ACK General Call Register */
#define DA1470X_I2C2_I2C2_CLR_ACTIVITY_OFFSET      0x005C /* Clear ACTIVITY Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_GEN_CALL_OFFSET      0x0068 /* Clear GEN_CALL Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_INTR_OFFSET          0x0040 /* Clear Combined and Individual Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_RD_REQ_OFFSET        0x0050 /* Clear RD_REQ Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_RX_DONE_OFFSET       0x0058 /* Clear RX_DONE Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_RX_OVER_OFFSET       0x0048 /* Clear RX_OVER Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_RX_UNDER_OFFSET      0x0044 /* Clear RX_UNDER Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_START_DET_OFFSET     0x0064 /* Clear START_DET Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_STOP_DET_OFFSET      0x0060 /* Clear STOP_DET Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_TX_ABRT_OFFSET       0x0054 /* Clear TX_ABRT Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_TX_OVER_OFFSET       0x004C /* Clear TX_OVER Interrupt Register */
#define DA1470X_I2C2_I2C2_CON_OFFSET               0x0000 /* I2C Control Register */
#define DA1470X_I2C2_I2C2_DATA_CMD_OFFSET          0x0010 /* I2C Rx/Tx Data Buffer and Command Register */
#define DA1470X_I2C2_I2C2_DMA_CR_OFFSET            0x0088 /* DMA Control Register */
#define DA1470X_I2C2_I2C2_DMA_RDLR_OFFSET          0x0090 /* I2C Receive Data Level Register */
#define DA1470X_I2C2_I2C2_DMA_TDLR_OFFSET          0x008C /* DMA Transmit Data Level Register */
#define DA1470X_I2C2_I2C2_ENABLE_OFFSET            0x006C /* I2C Enable Register */
#define DA1470X_I2C2_I2C2_ENABLE_STATUS_OFFSET     0x009C /* I2C Enable Status Register */
#define DA1470X_I2C2_I2C2_FS_SCL_HCNT_OFFSET       0x001C /* Fast Speed I2C Clock SCL High Count Register */
#define DA1470X_I2C2_I2C2_FS_SCL_LCNT_OFFSET       0x0020 /* Fast Speed I2C Clock SCL Low Count Register */
#define DA1470X_I2C2_I2C2_HS_MADDR_OFFSET          0x000C /* I2C High Speed Master Mode Code Address Register */
#define DA1470X_I2C2_I2C2_HS_SCL_HCNT_OFFSET       0x0024 /* High Speed I2C Clock SCL High Count Register */
#define DA1470X_I2C2_I2C2_HS_SCL_LCNT_OFFSET       0x0028 /* High Speed I2C Clock SCL Low Count Register */
#define DA1470X_I2C2_I2C2_IC_FS_SPKLEN_OFFSET      0x00A0 /* I2C SS and FS spike suppression limit Size */
#define DA1470X_I2C2_I2C2_IC_HS_SPKLEN_OFFSET      0x00A4 /* I2C HS spike suppression limit Size */
#define DA1470X_I2C2_I2C2_INTR_MASK_OFFSET         0x0030 /* I2C Interrupt Mask Register */
#define DA1470X_I2C2_I2C2_INTR_STAT_OFFSET         0x002C /* I2C Interrupt Status Register */
#define DA1470X_I2C2_I2C2_RAW_INTR_STAT_OFFSET     0x0034 /* I2C Raw Interrupt Status Register */
#define DA1470X_I2C2_I2C2_RXFLR_OFFSET             0x0078 /* I2C Receive FIFO Level Register */
#define DA1470X_I2C2_I2C2_RX_TL_OFFSET             0x0038 /* I2C Receive FIFO Threshold Register */
#define DA1470X_I2C2_I2C2_SAR_OFFSET               0x0008 /* I2C Slave Address Register */
#define DA1470X_I2C2_I2C2_SDA_HOLD_OFFSET          0x007C /* I2C SDA Hold Time Length Register */
#define DA1470X_I2C2_I2C2_SDA_SETUP_OFFSET         0x0094 /* I2C SDA Setup Register */
#define DA1470X_I2C2_I2C2_SS_SCL_HCNT_OFFSET       0x0014 /* Standard Speed I2C Clock SCL High Count Register */
#define DA1470X_I2C2_I2C2_SS_SCL_LCNT_OFFSET       0x0018 /* Standard Speed I2C Clock SCL Low Count Register */
#define DA1470X_I2C2_I2C2_STATUS_OFFSET            0x0070 /* I2C Status Register */
#define DA1470X_I2C2_I2C2_TAR_OFFSET               0x0004 /* I2C Target Address Register */
#define DA1470X_I2C2_I2C2_TXFLR_OFFSET             0x0074 /* I2C Transmit FIFO Level Register */
#define DA1470X_I2C2_I2C2_TX_ABRT_SOURCE_OFFSET    0x0080 /* I2C Transmit Abort Source Register */
#define DA1470X_I2C2_I2C2_TX_TL_OFFSET             0x003C /* I2C Transmit FIFO Threshold Register */

/* Register addresses *******************************************************/

#define DA1470X_I2C2_BASE                          0x50020700 /* I2C2 registers */

#define DA1470X_I2C2_I2C2_ACK_GENERAL_CALL         (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_ACK_GENERAL_CALL_OFFSET) /* I2C ACK General Call Register */
#define DA1470X_I2C2_I2C2_CLR_ACTIVITY             (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_CLR_ACTIVITY_OFFSET) /* Clear ACTIVITY Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_GEN_CALL             (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_CLR_GEN_CALL_OFFSET) /* Clear GEN_CALL Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_INTR                 (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_CLR_INTR_OFFSET) /* Clear Combined and Individual Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_RD_REQ               (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_CLR_RD_REQ_OFFSET) /* Clear RD_REQ Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_RX_DONE              (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_CLR_RX_DONE_OFFSET) /* Clear RX_DONE Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_RX_OVER              (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_CLR_RX_OVER_OFFSET) /* Clear RX_OVER Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_RX_UNDER             (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_CLR_RX_UNDER_OFFSET) /* Clear RX_UNDER Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_START_DET            (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_CLR_START_DET_OFFSET) /* Clear START_DET Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_STOP_DET             (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_CLR_STOP_DET_OFFSET) /* Clear STOP_DET Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_TX_ABRT              (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_CLR_TX_ABRT_OFFSET) /* Clear TX_ABRT Interrupt Register */
#define DA1470X_I2C2_I2C2_CLR_TX_OVER              (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_CLR_TX_OVER_OFFSET) /* Clear TX_OVER Interrupt Register */
#define DA1470X_I2C2_I2C2_CON                      (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_CON_OFFSET) /* I2C Control Register */
#define DA1470X_I2C2_I2C2_DATA_CMD                 (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_DATA_CMD_OFFSET) /* I2C Rx/Tx Data Buffer and Command Register */
#define DA1470X_I2C2_I2C2_DMA_CR                   (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_DMA_CR_OFFSET) /* DMA Control Register */
#define DA1470X_I2C2_I2C2_DMA_RDLR                 (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_DMA_RDLR_OFFSET) /* I2C Receive Data Level Register */
#define DA1470X_I2C2_I2C2_DMA_TDLR                 (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_DMA_TDLR_OFFSET) /* DMA Transmit Data Level Register */
#define DA1470X_I2C2_I2C2_ENABLE                   (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_ENABLE_OFFSET) /* I2C Enable Register */
#define DA1470X_I2C2_I2C2_ENABLE_STATUS            (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_ENABLE_STATUS_OFFSET) /* I2C Enable Status Register */
#define DA1470X_I2C2_I2C2_FS_SCL_HCNT              (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_FS_SCL_HCNT_OFFSET) /* Fast Speed I2C Clock SCL High Count Register */
#define DA1470X_I2C2_I2C2_FS_SCL_LCNT              (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_FS_SCL_LCNT_OFFSET) /* Fast Speed I2C Clock SCL Low Count Register */
#define DA1470X_I2C2_I2C2_HS_MADDR                 (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_HS_MADDR_OFFSET) /* I2C High Speed Master Mode Code Address Register */
#define DA1470X_I2C2_I2C2_HS_SCL_HCNT              (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_HS_SCL_HCNT_OFFSET) /* High Speed I2C Clock SCL High Count Register */
#define DA1470X_I2C2_I2C2_HS_SCL_LCNT              (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_HS_SCL_LCNT_OFFSET) /* High Speed I2C Clock SCL Low Count Register */
#define DA1470X_I2C2_I2C2_IC_FS_SPKLEN             (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_IC_FS_SPKLEN_OFFSET) /* I2C SS and FS spike suppression limit Size */
#define DA1470X_I2C2_I2C2_IC_HS_SPKLEN             (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_IC_HS_SPKLEN_OFFSET) /* I2C HS spike suppression limit Size */
#define DA1470X_I2C2_I2C2_INTR_MASK                (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_INTR_MASK_OFFSET) /* I2C Interrupt Mask Register */
#define DA1470X_I2C2_I2C2_INTR_STAT                (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_INTR_STAT_OFFSET) /* I2C Interrupt Status Register */
#define DA1470X_I2C2_I2C2_RAW_INTR_STAT            (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_RAW_INTR_STAT_OFFSET) /* I2C Raw Interrupt Status Register */
#define DA1470X_I2C2_I2C2_RXFLR                    (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_RXFLR_OFFSET) /* I2C Receive FIFO Level Register */
#define DA1470X_I2C2_I2C2_RX_TL                    (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_RX_TL_OFFSET) /* I2C Receive FIFO Threshold Register */
#define DA1470X_I2C2_I2C2_SAR                      (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_SAR_OFFSET) /* I2C Slave Address Register */
#define DA1470X_I2C2_I2C2_SDA_HOLD                 (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_SDA_HOLD_OFFSET) /* I2C SDA Hold Time Length Register */
#define DA1470X_I2C2_I2C2_SDA_SETUP                (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_SDA_SETUP_OFFSET) /* I2C SDA Setup Register */
#define DA1470X_I2C2_I2C2_SS_SCL_HCNT              (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_SS_SCL_HCNT_OFFSET) /* Standard Speed I2C Clock SCL High Count Register */
#define DA1470X_I2C2_I2C2_SS_SCL_LCNT              (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_SS_SCL_LCNT_OFFSET) /* Standard Speed I2C Clock SCL Low Count Register */
#define DA1470X_I2C2_I2C2_STATUS                   (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_STATUS_OFFSET) /* I2C Status Register */
#define DA1470X_I2C2_I2C2_TAR                      (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_TAR_OFFSET) /* I2C Target Address Register */
#define DA1470X_I2C2_I2C2_TXFLR                    (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_TXFLR_OFFSET) /* I2C Transmit FIFO Level Register */
#define DA1470X_I2C2_I2C2_TX_ABRT_SOURCE           (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_TX_ABRT_SOURCE_OFFSET) /* I2C Transmit Abort Source Register */
#define DA1470X_I2C2_I2C2_TX_TL                    (DA1470X_I2C2_BASE + DA1470X_I2C2_I2C2_TX_TL_OFFSET) /* I2C Transmit FIFO Threshold Register */

/* Register bit definitions *************************************************/


/* I2C2_ACK_GENERAL_CALL Register */

#define I2C2_ACK_GEN_CALL                          (1U << 0) /* ACK General Call. When set to 1, I2C Ctrl responds with a ACK (by asserting ic_d */

/* I2C2_CLR_ACTIVITY Register */

