AlmAck/svdtonuttx/demo/h/da1470x_i2c2.h
#define I2C2_IC_HS_SCL_HCNT_MASK                   (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C2_IC_HS_SCL_HCNT_POS                    (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C2_HS_SCL_LCNT Register */

#define I2C2_IC_HS_SCL_LCNT_MASK                   (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C2_IC_HS_SCL_LCNT_POS                    (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C2_IC_FS_SPKLEN Register */

#define I2C2_I2C_FS_SPKLEN_MASK                    (0xFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C2_I2C_FS_SPKLEN_POS                     (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C2_IC_HS_SPKLEN Register */

#define I2C2_I2C_HS_SPKLEN_MASK                    (0xFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C2_I2C_HS_SPKLEN_POS                     (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C2_INTR_MASK Register */

#define I2C2_M_SCL_STUCK_AT_LOW                    (1U << 14) /* M_SCL_STUCK_AT_LOW Register field Reserved bits */
#define I2C2_M_MASTER_ON_HOLD                      (1U << 13) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C2_M_RESTART_DET                         (1U << 12) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C2_M_GEN_CALL                            (1U << 11) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C2_M_START_DET                           (1U << 10) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C2_M_STOP_DET                            (1U << 9) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C2_M_ACTIVITY                            (1U << 8) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C2_M_RX_DONE                             (1U << 7) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C2_M_TX_ABRT                             (1U << 6) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C2_M_RD_REQ                              (1U << 5) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C2_M_TX_EMPTY                            (1U << 4) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C2_M_TX_OVER                             (1U << 3) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C2_M_RX_FULL                             (1U << 2) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C2_M_RX_OVER                             (1U << 1) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C2_M_RX_UNDER                            (1U << 0) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */

/* I2C2_INTR_STAT Register */

#define I2C2_R_SCL_STUCK_AT_LOW                    (1U << 14) /* 1 = R_SCL_STUCK_AT_LOW interrupt is active 0 = R_SCL_STUCK_AT_LOW interrupt is i */
#define I2C2_R_MASTER_ON_HOLD                      (1U << 13) /* Indicates whether master is holding the bus and TX FIFO is empty. Enabled only w */
#define I2C2_R_RESTART_DET                         (1U << 12) /* Indicates whether a RESTART condition has occurred on the I2C interface when DW_ */
#define I2C2_R_GEN_CALL                            (1U << 11) /* Set only when a General Call address is received and it is acknowledged. It stay */
#define I2C2_R_START_DET                           (1U << 10) /* Indicates whether a START or RESTART condition has occurred on the I2C interface */
#define I2C2_R_STOP_DET                            (1U << 9) /* Indicates whether a STOP condition has occurred on the I2C interface regardless  */
#define I2C2_R_ACTIVITY                            (1U << 8) /* This bit captures I2C Ctrl activity and stays set until it is cleared. There are */
#define I2C2_R_RX_DONE                             (1U << 7) /* When the controller is acting as a slave-transmitter, this bit is set to 1 if th */
#define I2C2_R_TX_ABRT                             (1U << 6) /* This bit indicates if the controller, as an I2C transmitter, is unable to comple */
#define I2C2_R_RD_REQ                              (1U << 5) /* This bit is set to 1 when the controller is acting as a slave and another I2C ma */
#define I2C2_R_TX_EMPTY                            (1U << 4) /* This bit is set to 1 when the transmit buffer is at or below the threshold value */
#define I2C2_R_TX_OVER                             (1U << 3) /* Set during transmit if the transmit buffer is filled to 32 and the processor att */
#define I2C2_R_RX_FULL                             (1U << 2) /* Set when the receive buffer reaches or goes above the RX_TL threshold in the I2C */
#define I2C2_R_RX_OVER                             (1U << 1) /* Set if the receive buffer is completely filled to 32 and an additional byte is r */
#define I2C2_R_RX_UNDER                            (1U << 0) /* Set if the processor attempts to read the receive buffer when it is empty by rea */

/* I2C2_RAW_INTR_STAT Register */

#define I2C2_SCL_STUCK_AT_LOW                      (1U << 14) /* CL_STUCK_AT_LOW Register field Reserved bits */
#define I2C2_MASTER_ON_HOLD                        (1U << 13) /* ndicates whether master is holding the bus and TX FIFO is empty. Enabled only wh */
#define I2C2_RESTART_DET                           (1U << 12) /* Indicates whether a RESTART condition has occurred on the I2C interface when DW_ */
#define I2C2_GEN_CALL                              (1U << 11) /* Set only when a General Call address is received and it is acknowledged. It stay */
#define I2C2_START_DET                             (1U << 10) /* Indicates whether a START or RESTART condition has occurred on the I2C interface */
#define I2C2_STOP_DET                              (1U << 9) /* Indicates whether a STOP condition has occurred on the I2C interface regardless  */
#define I2C2_ACTIVITY                              (1U << 8) /* This bit captures I2C Ctrl activity and stays set until it is cleared. There are */
#define I2C2_RX_DONE                               (1U << 7) /* When the controller is acting as a slave-transmitter, this bit is set to 1 if th */
#define I2C2_TX_ABRT                               (1U << 6) /* This bit indicates if the controller, as an I2C transmitter, is unable to comple */
#define I2C2_RD_REQ                                (1U << 5) /* This bit is set to 1 when I2C Ctrl is acting as a slave and another I2C master i */
#define I2C2_TX_EMPTY                              (1U << 4) /* This bit is set to 1 when the transmit buffer is at or below the threshold value */
#define I2C2_TX_OVER                               (1U << 3) /* Set during transmit if the transmit buffer is filled to 32 and the processor att */
#define I2C2_RX_FULL                               (1U << 2) /* Set when the receive buffer reaches or goes above the RX_TL threshold in the I2C */
#define I2C2_RX_OVER                               (1U << 1) /* Set if the receive buffer is completely filled to 32 and an additional byte is r */
#define I2C2_RX_UNDER                              (1U << 0) /* Set if the processor attempts to read the receive buffer when it is empty by rea */

